InformationRegisters/ПривязкаОтдел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаОтдел</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПулПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкаСотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаСотрудник</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Контакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Контакты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результативных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НетКонтакта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОставленаИнформация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПланированиеКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПланированиеКонтактов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкаОтветственный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаОтветственный</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РольОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РольОтдела</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обзвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выездной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Реестр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Реестр</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>AccumulationRegister.БалансДолжников</xr:Item>
				<xr:Item>InformationRegister.НачальныеДанныеДоговора</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.ДатыУчетаДоговоров</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>InformationRegister.ДанныеДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометитьКакНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗадолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПросроченныйОсновнойДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неустойка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Госпошлина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасчетаЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработанФССП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатЗапросаВФССП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписанВРегистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ЗапросыФильтра/Ext/Module.bsl
// В данном модуле содержатся функции
// для построения текстов запросов фильтра должников, фильтра передачи,
// а также функции построения виртуальных таблиц фильтра

Функция ПолучитьВиртуальнуюТаблицу(МенеджерВременныхТаблиц, ИмяТаблицы) Экспорт
    Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Должники.Должник
	|ИЗ
	|	" + ИмяТаблицы + " КАК Должники";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьВиртуальнуюТаблицу()

// ИсключитьАрхивныхДолжников
Функция ИсключитьАрхивныхДолжников(ТаблицаДолжников, Момент) Экспорт
	Перем Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПривязкаОтделСрезПоследних.Должник
	|ИЗ
	|	РегистрСведений.ПривязкаОтдел.СрезПоследних(
	|			&Момент,
	|			Должник В (&СписокДолжников)
	|				И Отдел.РольОтдела <> &Архив) КАК ПривязкаОтделСрезПоследних";
	
	СписокДолжников = ТаблицаДолжников.ВыгрузитьКолонку("Должник");
	
	Запрос.УстановитьПараметр("Момент", 			Момент);
	Запрос.УстановитьПараметр("СписокДолжников", 	СписокДолжников);
	Запрос.УстановитьПараметр("Архив", 				Перечисления.РольОтдела.Архив);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ИсключитьАрхивныхДолжников()

// ВТ ДолжникиОтдела
Процедура ДобавитьВиртуальнуюТаблицуДолжниковВОтделе(МенеджерВременныхТаблиц, Отдел, Момент, СвободныйПул = Ложь, ТаблицаДолжников = 0) Экспорт
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ТаблицаДолжников = 0 Тогда
		Условие = "";
	ИначеЕсли НЕ ТаблицаДолжников.Количество() = 0 Тогда
		Условие = " Должник В (&Список)"; 
		Запрос.УстановитьПараметр("Список", ТаблицаДолжников.ВыгрузитьКолонку("Должник"));
	КонецЕсли; 	
	               
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПривязкаОтделСрезПоследних.Должник,
	|	ПривязкаОтделСрезПоследних.Отдел
	|ПОМЕСТИТЬ ДолжникиОтдела
	|ИЗ
	|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&Момент, " + Условие + " ) КАК ПривязкаОтделСрезПоследних
	|ГДЕ
	|	ПривязкаОтделСрезПоследних.СвободныйПул = &СвободныйПул
	|	И ПривязкаОтделСрезПоследних.Отдел = &Отдел";
	
	Запрос.УстановитьПараметр("Момент", 		Момент);
	Запрос.УстановитьПараметр("Отдел", 			Отдел);
	Запрос.УстановитьПараметр("СвободныйПул", 	СвободныйПул);
	
    Запрос.Выполнить();
КонецПроцедуры // ДобавитьВиртуальнуюТаблицуДолжниковВОтделе()

// ВТ ДолжникиСотрудника
Процедура ДобавитьВиртуальнуюТаблицуДолжниковСотрудника(МенеджерВременныхТаблиц, Сотрудник, Момент, ТаблицаДолжников = 0) Экспорт
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ТаблицаДолжников = 0 Тогда
		Условие = "";
	ИначеЕсли НЕ ТаблицаДолжников.Количество() = 0 Тогда
		Условие = " Должник В (&Список)"; 
		Запрос.УстановитьПараметр("Список", ТаблицаДолжников.ВыгрузитьКолонку("Должник"));
	КонецЕсли; 	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПривязкаСотрудникСрезПоследних.Должник,
	|	ПривязкаСотрудникСрезПоследних.Сотрудник
	|ПОМЕСТИТЬ ДолжникиСотрудника
	|ИЗ
	|	РегистрСведений.ПривязкаСотрудник.СрезПоследних(&Момент, " + Условие + ") КАК ПривязкаСотрудникСрезПоследних
	|ГДЕ
	|	ПривязкаСотрудникСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Момент", 	Момент);
	Запрос.УстановитьПараметр("Сотрудник", 	Сотрудник);
	
    Запрос.Выполнить();
КонецПроцедуры // ДобавитьВиртуальнуюТаблицуДолжниковСотрудника()

Процедура ДобавитьВиртуальнуюТаблицуДолжниковСотрудникаНеАрхивные(МенеджерВременныхТаблиц, Сотрудник, Момент, ТаблицаДолжников = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПривязкаСотрудникСрезПоследних.Должник КАК Должник,
	|	ПривязкаСотрудникСрезПоследних.Сотрудник КАК Сотрудник,
	|	ПривязкаСотрудникСрезПоследних.СотрМенеджер КАК СотрМенеджер
	|ПОМЕСТИТЬ ДолжникиСотрудника
	|ИЗ
	|	РегистрСведений.ПривязкаСотрудник.СрезПоследних(&Момент, Должник В (&СписокДолжников)) КАК ПривязкаСотрудникСрезПоследних
	|ГДЕ
	|	(ПривязкаСотрудникСрезПоследних.Сотрудник = &Сотрудник
	|			ИЛИ ПривязкаСотрудникСрезПоследних.СотрМенеджер = &Сотрудник)";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Если ТаблицаДолжников = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Должник В (&СписокДолжников)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокДолжников", ТаблицаДолжников.ВыгрузитьКолонку("Должник"));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры // ДобавитьВиртуальнуюТаблицуДолжниковСотрудника()

// ВТ ДолжникиРегиона
Процедура ДобавитьВиртуальнуюТаблицуДолжниковРегиона(МенеджерВременныхТаблиц, Регион, ТаблицаДолжников = 0) Экспорт
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ТаблицаДолжников = 0 Тогда
		Условие = "";
	ИначеЕсли НЕ ТаблицаДолжников.Количество() = 0 Тогда
		Условие = " И Должники.Ссылка В (&Список)"; 
		Запрос.УстановитьПараметр("Список", ТаблицаДолжников.ВыгрузитьКолонку("Должник"));
	КонецЕсли; 	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Должники.Ссылка КАК Должник
	|ПОМЕСТИТЬ ДолжникиРегиона
	|ИЗ
	|	Справочник.Должники КАК Должники
	|ГДЕ
	|	Должники.Регион = &Регион " + Условие;
	
	Запрос.УстановитьПараметр("Регион", 	Регион);
	
    Запрос.Выполнить();
КонецПроцедуры // ДобавитьВиртуальнуюТаблицуДолжниковРегиона()

// ВТ ДолжникиРеестра
Процедура ДобавитьВиртуальнуюТаблицуДолжниковРеестра(МенеджерВременныхТаблиц, Реестр, ТаблицаДолжников = 0) Экспорт
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ТаблицаДолжников = 0 Тогда
		Условие = "";
	ИначеЕсли НЕ ТаблицаДолжников.Количество() = 0 Тогда
		Условие = " РеестрДолжники.Должник В (&Список)"; 
		Запрос.УстановитьПараметр("Список", ТаблицаДолжников.ВыгрузитьКолонку("Должник"));
	КонецЕсли; 	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеестрДолжники.Должник
	|ПОМЕСТИТЬ ДолжникиРеестра
	|ИЗ
	|	Документ.Реестр.Должники КАК РеестрДолжники
	|ГДЕ
	|	РеестрДолжники.Ссылка = &Реестр " + Условие;
	
	Запрос.УстановитьПараметр("Реестр", 	Реестр);
	
    Запрос.Выполнить();
КонецПроцедуры // ДобавитьВиртуальнуюТаблицуДолжниковРеестра()

// ВТ КоличествоКонтактовДолжников
Процедура ДобавитьВиртуальнуюТаблицуКоличествоКонтактовДолжников(МенеджерВременныхТаблиц, НазваниеВременнойТаблицыДолжников, Момент) Экспорт
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактыОбороты.ВсегоОборот КАК КоличествоКонтактов,
	|	КонтактыОбороты.РезультативныхОборот КАК КоличествоРезультативныхКонтактов,
	|	КонтактыОбороты.Должник
	|ПОМЕСТИТЬ КоличествоКонтактовДолжников
	|ИЗ
	|	" + НазваниеВременнойТаблицыДолжников + " КАК ВременнаяДолжники 
	//|	ВременнаяДолжники КАК ВременнаяДолжники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Контакты.Обороты(, &Момент, , ) КАК КонтактыОбороты
	|		ПО ВременнаяДолжники.Должник = КонтактыОбороты.Должник";
	
	
	Запрос.УстановитьПараметр("Момент", Момент);
	
	Запрос.Выполнить();
КонецПроцедуры // ДобавитьВиртуальнуюТаблицуДолжниковРеестра()

// ВТ ПланированиеКонтактов
Процедура ДобавитьВиртуальнуюТаблицуПланированиеКонтактов(МенеджерВременныхТаблиц, НазваниеВременнойТаблицыДолжников, Момент) Экспорт
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланированиеКонтактовСрезПоследних.Должник,
	|	ПланированиеКонтактовСрезПоследних.ДатаПланирования,
	|	ПланированиеКонтактовСрезПоследних.Сотрудник,
	|	ПланированиеКонтактовСрезПоследних.ТипКонтакта
	|ПОМЕСТИТЬ КоличествоКонтактовДолжников
	|ИЗ
	|	" + НазваниеВременнойТаблицыДолжников + " КАК ВременнаяДолжники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланированиеКонтактов.СрезПоследних КАК ПланированиеКонтактовСрезПоследних
	|		ПО ВременнаяДолжники.Должник = ПланированиеКонтактовСрезПоследних.Должник";
	
//	|	" + НазваниеВременнойТаблицыДолжников + " КАК " + НазваниеВременнойТаблицыДолжников + "
	
	Запрос.УстановитьПараметр("Момент", Момент);
	
	Запрос.Выполнить();
КонецПроцедуры // ДобавитьВиртуальнуюТаблицуДолжниковРеестра()

// ВТ ДолжникиОтветственного
Процедура ДобавитьВиртуальнуюТаблицуДолжниковОтветственного(МенеджерВременныхТаблиц, Сотрудник, Момент, ТаблицаДолжников = 0) Экспорт
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ТаблицаДолжников = 0 Тогда
		Условие = "";
	ИначеЕсли НЕ ТаблицаДолжников.Количество() = 0 Тогда
		Условие = " Должник В (&Список)"; 
		Запрос.УстановитьПараметр("Список", ТаблицаДолжников.ВыгрузитьКолонку("Должник"));
	КонецЕсли; 	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПривязкаОтветственныйСрезПоследних.Должник,
	|	ПривязкаОтветственныйСрезПоследних.Ответственный
	|ПОМЕСТИТЬ ДолжникиОтветственного
	|ИЗ
	|	РегистрСведений.ПривязкаОтветственный.СрезПоследних(&Момент, " + Условие + ") КАК ПривязкаОтветственныйСрезПоследних
	|ГДЕ
	|	ПривязкаОтветственныйСрезПоследних.Ответственный = &Сотрудник";
	
	Запрос.УстановитьПараметр("Момент", 	Момент);
	Запрос.УстановитьПараметр("Сотрудник", 	Сотрудник);
	
    Запрос.Выполнить();
КонецПроцедуры // ДобавитьВиртуальнуюТаблицуДолжниковОтветственного()
